from config import str_connect_db

# -----Параметры для соединения с БД-----------
dns = str_connect_db

# ------Данные для вставки в таблицы------------
# Данные для вставки в таблицу author
name_authors = [('Булгаков М.А.',),
                ('Достоевский Ф.М.',),
                ('Есенин С.А.',),
                ('Пастернак Б.Л.',),
                ('Лермонтов М.Ю.',)]
# Данные для вставки в таблицу genre
name_genre = [('Роман',), ('Поэзия',), ('Приключения',)]
# Данные для вставки в таблицу book
book_data = [('Мастер и Маргарита', 1, 1, 670.99, 3),
             ('Белая гвардия', 1, 1, 540.50, 5),
             ('Идиот', 2, 1, 460.00, 10),
             ('Братья Карамазовы', 2, 1, 799.01, 2),
             ('Игрок', 2, 1, 480.50, 10),
             ('Стихотворения и поэмы', 3, 2, 650.00, 15),
             ('Черный человек', 3, 2, 570.20, 6),
             ('Лирика', 4, 2, 518.99, 2)]
# Данные для вставки в таблицу city
city_data = [('Москва', 5),
             ('Санкт-Петербург', 3),
             ('Владивосток', 12)]
# Данные для вставки в таблицу client
client_data = [('Баранов Павел', 3, 'baranov@test'),
               ('Абрамова Катя', 1, 'abramova@test'),
               ('Семенонов Иван', 2, 'semenov@test'),
               ('Яковлева Галина', 1, 'yakovleva@test')]
# Данные для вставки в таблицу buy_book
buy_book = [(1, 1, 1),
            (1, 7, 2),
            (1, 3, 1),
            (2, 8, 2),
            (3, 3, 2),
            (3, 2, 1),
            (3, 1, 1),
            (4, 5, 1)]
# Данные для вставки в таблицу step
step_data = [('Оплата',),
             ('Упаковка',),
             ('Транспортировка',),
             ('Доставка',)]
# Данные для вставки в таблицу buy_step
buy_step_data = [(1, 1, '2020-02-20', '2020-02-20'),
                 (1, 2, '2020-02-20', '2020-02-21'),
                 (1, 3, '2020-02-22', '2020-03-07'),
                 (1, 4, '2020-03-08', '2020-03-08'),
                 (2, 1, '2020-02-28', '2020-02-28'),
                 (2, 2, '2020-02-29', '2020-03-01'),
                 (2, 3, '2020-03-02', None),
                 (2, 4, None, None),
                 (3, 1, '2020-03-05', '2020-03-05'),
                 (3, 2, '2020-03-05', '2020-03-06'),
                 (3, 3, '2020-03-06', '2020-03-10'),
                 (3, 4, '2020-03-11', None),
                 (4, 1, '2020-03-20', None),
                 (4, 2, None, None),
                 (4, 3, None, None),
                 (4, 4, None, None)]
# Данные для вставки в таблицу buy
buy_data = [('Доставка только вечером', 1),
            (None, 3),
            ('Упаковать каждую книгу по отдельности', 2),
            (None, 1)]
